{
  "translation": {
    "techRadar": {
      "radarName": "Tech Radar",
    "versionLabel": "Version",
    "revisionsText": "Revisions:",
    "buttonChangeLanguage": "Change language",
    "navbar": {
      "help": "How to use the Tech Radar?",
      "overview": "Technologies Overview",
      "search": "Search",
      "searchPlaceholder": "What are you looking for?"
    },
    "footerFootnote": "DB1 Global Software is a a software development company with 20 years of know-how. We are part of DB1 Group. The group is a tech company focused on the digital transformation of B2B companies. The brand focuses on ensuring future growth by addressing the current needs of clients.",
    "legalInformationLabel": "Created using AOE Radar",
    "socialLinksLabel": "Follow us:",
    "pageIndex": {
      "publishedLabel": "Quadrant Overview"
    },
    "pageItem": {
      "quadrantOverview": "Quadrant Overview"
    },
    "zoom-in": "Zoom in",
    "quadrant": "quadrant",
    "quadrants": {
      "languages-and-frameworks": "Languages & Frameworks",
      "methods-and-patterns": "Methods & Patterns",
      "platforms-and-operations": "Platforms & Operations",
      "tools": "Tools"
    },
    "pageOverview": {
      "title": "Technologies Overview"
    },
    "rings": {
      "all": "all",
      "adopt": "adopt",
      "trial": "trial",
      "assess": "assess",
      "hold": "hold"
    },
    "pageHelp": {
      "headlinePrefix": "How to use the",
      "paragraphs": [
        {
          "headline": "Introduction",
          "values": [
            "Technology is moving fast and new technologies and innovations appear continuously.",
            "It's essential for a development and technology company such as DB1 to constantly improve and keep track with the latest useful innovations. It is important to openly look for innovations and new technologies and to question established technologies and methods every now and then.",
            "But, it is also important to wisely choose which technologies to use in our daily work and in the different projects we are carrying out. As we all know: There is no silver bullet."
          ]
        },
        {
          "headline": "What is the DB1 Technology Radar",
          "values": [
            "The Tech Radar is an overview of different technologies - from languages, frameworks, tools and patterns to platforms - that we consider relevant to the project context we serve: corporate applications."
          ]
        },
        {
          "headline": "How it is created",
          "values": [
            "The items in the technology radar are raised by the different teams and therefore a lot of the items are related to the work and challenges the teams face in the different projects. In fact, we don't include anything on the radar, which we haven't already tried ourselves at least once.",
            "There have been a lot of valuable discussions in different expert groups about the classification and details of each of technologies and innovations. And the result of all this can be found in the latest technology radar.",
            "Once added, a new item on the radar is analyzed by a research step by our Staff Engineering team"
          ]
        },
        {
          "headline": "How should it be used",
          "values": [
            "The radar acts as an overview of technologies that we think everyone in the teams should currently know about.",
            "Its goal is to act as a guide and inspiration for the daily work in the teams. Its purpose is also to provide helpful information and a bird's-eye perspective - so that decisions can be taken with a much deeper understanding of the subject matter. This results in more-informed and better-aligned decisions.",
            "We also hope that developers outside of DB1 find the information in our technology overview inspirational.",
            "We group or categorize the items in 4 quadrants (sometimes, when it's not 100% clear where a item belongs, we choose the best fit)."
          ]
        }
      ],
      "quadrants": [
        {
          "description": "Here we've placed development languages, development frameworks, which are useful for implementing custom software of all kinds.",
          "name": "Languages and Frameworks"
        },
        {
          "description": "Patterns are very important. Many of them last much longer than tools or frameworks. Therefore, this category determines how we develop software.",
          "name": "Methods and Patterns"
        },
        {
          "description": "Here we include infrastructure platforms and services. We also use this category to communicate news about DB1 services that we want all DB1 teams to be aware of.",
          "name": "Platforms and Operations"
        },
        {
          "description": "Here we put different software tools - from small helpers to bigger software projects.",
          "name": "Tools"
        }
      ],
      "quadrantsPreDescription": "Os quadrantes são:",
      "rings": [
        {
          "description": "We can clearly recommend this technology. We have used it for longer period of time in many teams and it has proven to be stable and useful.",
          "name": "Adopt"
        },
        {
          "description": "We have used it with success and recommend to have a closer look at the technology in this ring. The goal of items here is to look at them more closely, with the goal to bring them to the adopt level.",
          "name": "Trial"
        },
        {
          "description": "We have tried it out and we find it promising. We recommend having a look at these items when you face a specific need for the technology in your project.",
          "name": "Assess"
        },
        {
          "description": "This category is a bit special. Unlike the others, we recommend to stop doing or using something. That does not mean that they are bad and it often might be ok to use them in existing projects. But we move things here if we think we shouldn't do them anymore - because we see better options or alternatives now.",
          "name": "Hold"
        }
      ],
      "ringsPreDescription": "Each of the items is classified in one of these rings:",
      "sourcecodeLink": {
        "description": "Contributions and source code of the Tech Radar are on github:",
        "href": "https://github.com/AOEpeople/aoe_technology_radar",
        "name": "AOE Tech Radar on Github"
      }
    },
    "legend": {
      "new": "New in this version",
      "recently": "Recently changed",
      "unchanged": "Unchanged"
    },
    "flags": {
      "new": "New"
    }
    }
  }
}